<?php

return [
    'yourCity'                      => 'Расположение',
    'auth'                          => 'Вход/Регистрация',

    'age_detec_title'               => 'Проверка возраста',
    'age_detec_body'                => 'Данный сайт содержит материалы с возрастными ограничениями, включая обнаженные части тела. Подтвердите что вам исполнилось 18 лет или вы достигли совершеннолетия.',
    'age_detec_yes'                 => 'Мне есть 18 лет',
    'age_detec_no'                  => 'Выход',

    'subscribe_title'               => 'Подписка',
    'subscribe_text'                => 'Текст',
    'subscribe_btn_title'           => 'Кнопка',
];
