<?php

return [
    'list'              => 'Список вариантов',

    'nominal'           => 'Номинал',
    'bonus'             => 'Бонус',
    'bonus_form'        => 'Бонус за пополнение',
    'pay_link'          => 'Ссылка для получения пинкода',
    'pin_codes'         => 'Пинкоды',
    'status'            => 'Статус',
    'generate'          => 'Генерация',

    'pin_code_choice'   => ':num пинкод|:num пинкода|:num пинкодов',
    'pin_code_rules'    => 'Каждый пин-код должен начинаться с новой строки. Будут учтены все символы каждой строки.',
    'pin_code_count'    => 'Пинкоды',
    'pin_code_exists'   => 'Пин-код :pin_code уже используеться для платежа с номиналом :nominal',

    'notify_created'    => 'Номинал добавлен',
    'notify_updated'    => 'Номинал изменен',
    'notify_deleted'    => 'Номинал удален',
];
