<?php

return [
    'list'              => 'Настройки оплаты',

    'status'            => 'Статус',
    'shop_id'           => 'ID Вашего магазина',
    'token'             => 'API Токен',
    'order_wait_id'     => 'Статус ожидания оплаты',
    'order_success_id'  => 'Статус успешной оплаты',
    'order_fail_id'     => 'Статус неудачной оплаты',
    'success_url'       => 'URL успешной оплаты',
    'fail_url'          => 'URL возврата в случае неудачи',
    'min_amount'        => 'Мин. сумма для пополнения',
    'api_check'         => 'Cron проверка транзакций',
    'last_check_no'     => 'Последняя проверка: Не выполнялось',
    'last_check'        => 'Последняя проверка: :date',

    'notify_saved'      => 'Настройки сохранены',
    'notify_file_create'=> 'Файл для верификации будет создан автоматически.',
];
