<?php

return [
    'info_text'             => 'Мы стремимся стать лучше для вас! Мы собираем обратную связь от посетителей сайта, максимально быстро обрабатываем её. Заполните простую короткую форму обратной связи внизу страницы если вы планируете:',
    'var_stemp_1'           => 'приобрести рекламу или узнать о возможностях сотрудничества;',
    'var_stemp_2'           => 'отправить предложение по улучшению функционала;',
    'var_stemp_3'           => 'сообщить о найденной ошибке в работе проекта;',
    'var_stemp_4'           => 'оставить жалобу на пользователя.',
    'pre_form_text'         => 'При заполнении полей убедись в правильности введенного адреса электронной почты и как можно понятней опиши суть вопроса, который необходимо решить. Если есть такая возможность, то укажи ссылку на объявление и прочие детали связанные с запросом: дата и время события, скриншот проблемы или ошибки. Чтобы запрос быстро попал на рассмотрение к нужному специалисту и получил должный ответ выбирай максимально подходящую тему для отправки сообщения.',

    'form_theme'            => 'Тема обращения',
    'form_name'             => 'Имя',
    'form_email'            => 'E-mail',
    'form_message'          => 'Сообщение',
    'form_submit'           => 'Отправить',
    'notify_message_send'   => 'Сообщение отправлено',
];
