<?php

return [
    'post_title'        => 'Услуги для анкет',
    'salon_title'       => 'Услуги для салонов',
    'activation_t'      => 'Активация анкет',
    'activation_d'      => 'Активация анкет на определенный период для отображения на сайте.',
    's_activation_t'    => 'Активация салона',
    's_activation_d'    => 'Активация салона на определенный период для отображения на сайте.',
    'diamind_t'         => 'Diamond статус',
    'diamind_d'         => 'Анкеты со статусом Diamond отображаются выше анкет со статусом VIP. Благодаря этому статусу вероятность просмотра вашей анкеты увеличивается на 500% по сравнению с обычными анкетами.',
    'vip_t'             => 'VIP статус',
    'vip_d'             => 'Анкеты со статусом VIP отображаются выше обычных, но ниже Diamond. Этот статус повышает вероятность просмотра вашей анкеты на 250% по сравнению с бесплатными анкетами.',
    'color_t'           => 'Color статус',
    'color_d'           => 'Анкеты со статусом Color выделяются цветной рамкой на главном фото, что делает их более заметными и привлекает больше внимания по сравнению с анкетами без выделения.',
    'top_t'             => 'ТОП позиция',
    'top_d'             => 'ТОП-анкеты всегда располагаются выше остальных в соответствующем статусе и разделе. Поднятие анкеты в ТОП поможет вам увеличить количество звонков и привлечь больше внимания, обеспечив отображение на первой позиции.',
    's_top_d'           => 'ТОП-салоны всегда располагаются выше остальных. Поднятие салона в ТОП поможет вам увеличить количество клиентов и привлечь больше внимания, обеспечив отображение на первой позиции.',

    'price_days'        => 'Период/цена',
    'price_days_var'    => ':day / <span>:price</span>',
    'price_up_to_top'   => 'Стоимость поднятия <span>:price</span>/сутки',
    'price_act_ext'     => 'Стоимость активации и продления <span>:price</span>/сутки',
    'price_act'         => 'Стоимость активации <span>:price</span>/сутки',
    'price_ext'         => 'Стоимость продления <span>:price</span>/сутки',
];
