<?php

return [
    'page_main'             => 'Черный список',

    'black_list'            => 'Черный список позволяет вам добавить в базу недобросовестного клиента, и написать отзыв о нем. Эта информация также может помочь другим моделям избежать данного клиента. Также вам доступна вся наша база для проверки ваших клиентов.',

    'search'                => 'Проверить клиента',
    'add_client'            => 'Добавить клиента',
    'my_list'               => 'Мой список',
    'my_list_empty'         => 'Вы ещё не добавляли номера телефонов в базу.',
    'looking'               => 'Искали: ',
    'phone_review'          => 'Номер телефона клиента',
    'rating_review'         => 'Рейтинг клиента',
    'text_review'           => 'Ваш отзыв о клиенте (до 250 символов)',
    'btn_search'            => 'Искать',
    'btn_add'               => 'Добавить номер',

    'notify_not_found'      => 'Телефон не найден в базе',
    'notify_empty'          => 'Вы не ввели номер',
    'notify_result'         => 'Найдено :num',
    'notify_exists'         => 'Вы уже добавляли отзыв для данного номера телефона',

    'notify_empty_phone'    => 'Вы не ввели номер телефона клиента',
    'notify_empty_rating'   => 'Вы не выбрали рейтинг клиента',
    'notify_empty_text'     => 'Вы не указали текст отзыва',

    'notify_delete_empty'   => 'Данная запись не найдена',
    'notify_delete_other'   => 'Попытка удалить чужую запись',
    'notify_delete_success' => 'Запись удалена',
    'notify_delete_confirm' => 'Вы уверены, что хотите удалить номер из базы?',

    'notify_success'        => 'Номер добавлен в базу.',
];
