<?php

return [
    'list'              => 'Список городов',
    'title'             => 'Название',
    'latitude'          => 'Широта',
    'longitude'         => 'Долгота',
    'status'            => 'Статус',

    'regional_city'     => 'Областные города',

    'select_on_the_map' => 'Установите метку на карте в центре нужного города что бы получить координаты.',

    'notify_created'    => 'Новый город добавлен',
    'notify_updated'    => 'Город отредактирована',
    'notify_deleted'    => 'Город удален',
];
